
## Plan Result (infrastructure)

[CI link](https://github.com/nangashi/dcr/actions/runs/7360870816)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_glue_catalog_database.catalog_db
  * aws_glue_catalog_table.cloudtrail_logs


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_glue_catalog_database.catalog_db will be created
  + resource "aws_glue_catalog_database" "catalog_db" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "catalog_db_prd"
      + tags_all     = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
    }

  # aws_glue_catalog_table.cloudtrail_logs will be created
  + resource "aws_glue_catalog_table" "cloudtrail_logs" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "catalog_db_prd"
      + id            = (known after apply)
      + name          = "cloudtrail_logs_prd"
      + parameters    = {
          + "EXTERNAL"                           = "true"
          + "projection.enabled"                 = "true"
          + "projection.timestamp.format"        = "yyyy/MM/dd"
          + "projection.timestamp.interval"      = "1"
          + "projection.timestamp.interval.unit" = "DAYS"
          + "projection.timestamp.range"         = "2021/01/01,NOW"
          + "projection.timestamp.type"          = "date"
          + "storage.location.template"          = "s3://cloudtrail-log-384081048358-prd/AWSLogs/384081048358/CloudTrail/ap-northeast-1/${timestamp}"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_keys {
          + name = "timestamp"
          + type = "string"
        }

      + storage_descriptor {
          + input_format  = "com.amazon.emr.cloudtrail.CloudTrailInputFormat"
          + location      = "s3://cloudtrail-log-384081048358-prd/AWSLogs/384081048358/CloudTrail/ap-northeast-1/"
          + output_format = "org.apache.hadoop.hive.ql.io.HiveIgnoreKeyTextOutputFormat"

          + columns {
              + name = "eventtime"
              + type = "string"
            }
          + columns {
              + name = "eventname"
              + type = "string"
            }
          + columns {
              + name = "eventsource"
              + type = "string"
            }
          + columns {
              + name = "awsregion"
              + type = "string"
            }
          + columns {
              + name = "sourceipaddress"
              + type = "string"
            }
          + columns {
              + name = "useragent"
              + type = "string"
            }
          + columns {
              + name = "errorcode"
              + type = "string"
            }
          + columns {
              + name = "errormessage"
              + type = "string"
            }
          + columns {
              + name = "useridentity"
              + type = "struct<type:string,principalid:string,arn:string,accountid:string,invokedby:string,accesskeyid:string,username:string,sessioncontext:struct<attributes:struct<mfaauthenticated:string,creationdate:string>,sessionIssuer:struct<type:string,principalId:string,arn:string,accountId:string,userName:string>>>"
            }
          + columns {
              + name = "requestparameters"
              + type = "string"
            }
          + columns {
              + name = "responseelements"
              + type = "string"
            }
          + columns {
              + name = "additionaleventdata"
              + type = "string"
            }
          + columns {
              + name = "resources"
              + type = "array<struct<arn:string,accountId:string,type:string>>"
            }

          + ser_de_info {
              + name                  = "CloudTrailSerde"
              + serialization_library = "com.amazon.emr.hive.serde.CloudTrailSerde"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":35,"Program":"tfcmt","SHA1":"f2d92003cc8e9f1a70ae919f5fdf7223e9e05572","Target":"infrastructure","Vars":{},"WorkflowName":"Check Pull Requests"} -->